app/Http/Services/CartService.php

select `id`, `name`, `price`, `amount`, `main_image_path` from `products` where `id` in (3) and `products`.`deleted_at` is null
---
    public function getProduct()
    {
        $carts = Session::get('carts');
        if (is_null($carts)) return [];

        $productId = array_keys($carts);
        return Product::select('id', 'name', 'price', 'amount', 'main_image_path')
            ->whereIn('id', $productId)
            ->get();