app/Http/View/Composers/CatagoryComposer.php

    public function compose(View $view)
    {
        $categories =  Category::select('id','name','parent_id')->orderByDesc('id')->get();
---
select `id`, `name`, `parent_id` from `categories` where `categories`.`deleted_at` is null order by `id` desc