app/Http/View/Composers/MenuComposer.php

    public function compose(View $view)
    {
        $menus =  Menu::select('id','name','parent_id')->orderByDesc('id')->get();
---
select `id`, `name`, `parent_id` from `menus` where `menus`.`deleted_at` is null order by `id` desc