app/Http/Controllers/User/ProductController.php

    public function product_comment(Request $request): \Illuminate\Http\RedirectResponse
    {
        $product_id = $request->product_id;
        $rateValue = $request->rating;
        $productName = $this->product->where('id', $product_id)->pluck('name');
        try {
            DB::beginTransaction();
            $comment= Comment::where('user_id', Auth::id())->where('product_id',$product_id)->first();
            if(is_null($comment)){
                $newCommentData = [
                    'user_id' => Auth::user()->id,
                    'product_id' => $product_id,
                    'content' => $request->comment,
                ];
                if (!empty($request->parent_id)) {
                    $newCommentData['parent_id'] = $request->parent_id;
                }
                $newComment =  Comment::create($newCommentData);
                if(!is_null($rateValue)){
                    Rate::create([
                        'user_id' => Auth::user()->id,
                        'product_id' => $product_id,
                        'comment_id' => $newComment->id,
                        'rate_value' => $rateValue
                    ]);
---
select `name` from `products` where `id` = '114' and `products`.`deleted_at` is null
select * from `comments` where `user_id` = 2 and `product_id` = '114' and `comments`.`deleted_at` is null limit 1
insert into `comments` (`user_id`, `product_id`, `content`, `updated_at`, `created_at`) values (2, '114', 'aaaaaaaaaaaaaaaaaa', '2022-06-17 23:15:35', '2022-06-17 23:15:35')
insert into `rates` (`user_id`, `product_id`, `comment_id`, `rate_value`, `updated_at`, `created_at`) values (2, '114', 3, '3', '2022-06-17 23:15:35', '2022-06-17 23:15:35')