app/Http/Controllers/customers/CartController.php

select * from `products` where `id` = '1' and `products`.`deleted_at` is null limit 1
---
    public function store(Request $request)
    {

        try {
            $data = $request->all();
            if ($data['cart_product_qty'] < 10) {
                $productId = $data['cart_product_id'];
                $qty = $data['cart_product_qty'];

                $product = Product::where('id', $productId)->first();

select * from `user_profiles` where `user_id` = 1 limit 1
---
    public function getCheckout()
    {
        $res = UserProfile::where('user_id', auth()->user()->id)->first();

insert into `orders` (`user_id`, `user_name`, `user_email`, `user_phone`, `user_address`, `user_note`, `status`, `item_count`, `sub_total`, `tax`, `total`, `updated_at`, `created_at`) values (1, 'admin', 'admin@gmail.com', '23123123', 'dasd asda', '', 0, 8, 163056, 16306, 179362, '2022-06-16 22:56:37', '2022-06-16 22:56:37')
insert into `order_details` (`product_id`, `product_price`, `product_qty`, `total`, `order_id`, `updated_at`, `created_at`) values (1, 21665, 1, 21665, 5, '2022-06-16 22:56:37', '2022-06-16 22:56:37')
---
    public function postOrder(Request $request)
    {
        try {
            DB::beginTransaction();
            $orderInfo = $request->all();
            $cart = Cart::content();
//            dd(Cart::subtotal(0,',',''));
            $dataOrderCreate = [
                'user_id' => auth()->user()->id,
                'user_name' => $orderInfo['name'],
                'user_email' => $orderInfo['email'],
                'user_phone' => $orderInfo['phone'],
                'user_address' => $orderInfo['address'],
                'user_note' => $orderInfo['note'],
                'status' => 0,
                'item_count' => intval(Cart::count(0,',','')),
                'sub_total' => intval(Cart::subtotal(0,',','')),
                'total' => intval(Cart::total(0,',','')),
            ];
//            if(!empty($orderInfo['coupon-code'])){
//
//                $orderCreate['discount'] = $orderInfo['coupon-code'];
//            }
            $newOrder = $this->order->create($dataOrderCreate);

            foreach ($cart as $product){
                $newOrder->orderDetail()->create([
                    'product_id' => $product->id,
                    'product_price' => intval($product->price),
                    'product_qty' => intval($product->qty),
                    'total' => intval($product->qty) * intval($product->price),
                ]);