app/Http/Controllers/customers/HomeController.php

    public function index(){
        //slider
        $sliders = $this->slider->where('type', 1)->get();
        // latest
        $latestPosts = $this->product->latest()->limit(10)->get();
        //cate products
        $categories = $this->category->inRandomOrder()->limit(5)->get();

        //on sale
        $onSaleTag = null;
        try {
            $onSaleTag = Tag::where('name', 'sale')->orWhere('name', 'SALE')->first();
        }catch (\Exception $exception){
        }
        $onSaleProducts = null;
         if(!is_null($onSaleTag)){
             $onSaleProducts = $onSaleTag->products;
         }

         //banner
        $bannerCate = $this->slider->where('type', 2)->where('content_position', 'cate-pro')->latest()->first();
        $bannerLatest= $this->slider->where('type', 2)->where('content_position', 'latest')->latest()->first();
---
select * from `sliders` where `type` = 1 and `sliders`.`deleted_at` is null
select * from `products` where `products`.`deleted_at` is null order by `created_at` desc limit 10
select * from `categories` where `categories`.`deleted_at` is null order by RAND() limit 5
select * from `tags` where `name` = 'sale' or `name` = 'SALE' limit 1
select * from `sliders` where `type` = 2 and `content_position` = 'latest' and `sliders`.`deleted_at` is null order by `created_at` desc limit 1