app/Http/Controllers/customers/HomeController.php

select * from `sliders` where `sliders`.`deleted_at` is null
---
    public function index(){
        //slider
        $sliders = $this->slider->all();