app/Http/Controllers/customers/UserController.php

select * from `user_profiles` where `user_id` = 1 limit 1
---
    public function show()
    {
        try {
            $user_info = UserProfile::where('user_id', auth()->user()->id)->first();