app/Http/Controllers/AdminProductController.php

select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function index()
    {
        $productsList =  $this->product->latest()->paginate(5);