app/Http/Controllers/AdminRoleController.php

select * from `roles` where `roles`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `roles` where `roles`.`deleted_at` is null
---
    public function index()
    {
        $roles = $this->role->paginate(config('constants.pagination_records'));

select * from `roles` where `roles`.`id` = '1' and `roles`.`deleted_at` is null limit 1
insert into `role_permission` (`permission_id`, `role_id`) values (12, 1)
---
    public function update($id, Request $request)
    {
        try {
            DB::beginTransaction();
            $updateRole = $this->role->find($id);

            $updateRole->update([
                'name' => $request->name,
                'display_name' => $request->display_name
            ]);
            $updateRole->permissions()->sync($request->permission_id);