app/Http/Controllers/AdminProductController.php

    public function index(Request $request)
    {

        (!is_null($request->category_id))?$cateID = $request->category_id:$cateID = null;
        (!is_null($request->sort_by))?$sortBy = $request->sort_by: $sortBy = 'created_at-desc';
        (!is_null($request->q))?$search = $request->q: $search ='';

        $sortColumn = explode('-', $sortBy)[0];
        $sortDirection = explode('-', $sortBy)[1];
        if (is_null($cateID)) {
            $productsList = Product::query()
                ->where('name', 'like', '%' . $search . '%')
                ->orWhere('created_at', 'like', '%' . $search . '%')
                ->orWhere('price', '>=', $search )
                ->orderBy($sortColumn, $sortDirection)
                ->paginate(config('constants.pagination_records'));
---
select count(*) as aggregate from `products` where (`name` like '%Bò Hầm%' or `created_at` like '%Bò Hầm%' or `price` >= 'Bò Hầm') and `products`.`deleted_at` is null

    public function edit($id)
    {
        $product = $this->product->find($id);
---
select * from `products` where `products`.`id` = '114' and `products`.`deleted_at` is null limit 1

    private function getAllCategories($parentId): string
    {
        $data = $this->category->all();
---
select * from `categories` where `categories`.`deleted_at` is null