app/Http/Controllers/AdminUserController.php

    public function index(){
        $users = $this->user->latest()->paginate(config('constants.pagination_records'));
---
select * from `users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users`

    public function store(Request $request)
    {

        try{
            //        $validated = $request->validated();
        DB::beginTransaction();
            $user = $this->user->create([
                'name' => $request->name,
                'email'=> $request->email,
                'password'=> Hash::make($request->password)
            ]);
            $roleIds = $request->role_ids;
            $user->roles()->attach($roleIds);
---
insert into `user_role` (`role_id`, `user_id`) values ('2', 25)
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Moderator', 'mod@gmail.com', '$2y$10$qqGR6EbDWhIxxooTq/Md7uLM8rtNLIzkvDPbfnpfXcINIxNrtrh0S', '2022-06-18 22:15:05', '2022-06-18 22:15:05')

    public function edit($id)
    {
        $roles = $this->role->all();
---
select * from `roles` where `roles`.`deleted_at` is null

    public function update($id, Request $request)
    {
        try{
            //        $validated = $request->validated();
            DB::beginTransaction();
            $userUpdate = $this->user->find($id);
---
select * from `users` where `users`.`id` = '26' limit 1