app/Http/Controllers/AminSliderController.php

    public function index()
    {
        $sliderList =  $this->slider->latest()->paginate(config('constants.pagination_records'));
---
select * from `sliders` where `type` = 1 and `sliders`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sliders` where `type` = 1 and `sliders`.`deleted_at` is null

    public function create()
    {
        $sliderList = $this->slider->latest()->paginate(config('constants.pagination_records'));
---
select * from `sliders` where `type` = 2 and `sliders`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sliders` where `type` = 2 and `sliders`.`deleted_at` is null

    public function store(Request $req): RedirectResponse
    {
        try {
            DB::beginTransaction();
            $dataSliderCreate = [
                'title' => $req->title,
                'subtitle' => $req->subtitle,
                'description' => $req->description,
                'content_position' => $req->content_position,

            ];
            if(isset($req->product_id)){
                $dataSliderCreate['product_id'] = $req->product_id;
            }
            //image data
            if ($req->hasFile('slider_image')) {
                $image_file = $req->slider_image;
                $slider_image_info = $this->getUploadedImageInfo($image_file, 'slider');
                if (!empty($slider_image_info)) {
                    $dataSliderCreate['image_path'] = $slider_image_info['file_path'];
                    $dataSliderCreate['image_name'] = $slider_image_info['file_name'];
                }
            }
            // add new slider
            $this->slider->create($dataSliderCreate);
---
insert into `sliders` (`title`, `subtitle`, `description`, `content_position`, `product_id`, `image_path`, `image_name`, `updated_at`, `created_at`) values ('<p>HELLO WORLD</p>', 'Quá là ngon luôn ông cháu ơi', '', 'right', '12', '/storage/slider/1/main-slider-1-1.1655475611808.jpg', 'main-slider-1-1.1655475611808.jpg', '2022-06-17 21:20:11', '2022-06-17 21:20:11')