app/Http/Controllers/CategoryController.php

    private function getAllCategories($parentId): string
    {
        $data = $this->category->all();
---
select * from `categories` where `categories`.`deleted_at` is null