app/Http/Controllers/OrderController.php

    public function edit($id)
    {
        $order = Order::where('id', $id)->first();
        $orderDetail = $order->orderDetail;
---
select * from `orders` where `id` = '2' limit 1
select * from `order_details` where `order_details`.`order_id` = 2 and `order_details`.`order_id` is not null

    public function update_status(Request $request): JsonResponse
    {
        try {
            DB::beginTransaction();
            $data = $request->all();
            $orderId = $data['order_id'];
            $status = $data['status'];

            Order::where('id',$orderId)->update([
                'status' => $status
            ]);
---
update `orders` set `status` = '3', `orders`.`updated_at` = '2022-06-19 00:59:08' where `id` = '10'

    public function user_purchase_show($id){

        $userOrders = Order::where('user_id', $id)->latest()->get();

        $orders = [];
        foreach ($userOrders as $userOrder) {
            $listProductOfAnOrder = [];
            $anOrder = $userOrder;
            $details = $userOrder->orderDetail;
---
select * from `orders` where `user_id` = '1' order by `created_at` desc
select * from `order_details` where `order_details`.`order_id` = 2 and `order_details`.`order_id` is not null